src_Extension/Reports/ВыпускЦехаСТрудозатратами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ВыпускЦехаСТрудозатратами</Name>
		</Properties>
	</Report>
</MetaDataObject>

src_Extension/Enums/СпособыПолученияМатериаловВСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыПолученияМатериаловВСпецификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обеспечивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизвестиПоСпецификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизводитсяНаЭтапе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>15</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_Extension/Catalogs/ЭтапыПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЭтапыПроизводства</Name>
			<Owners>
				<xr:Item>Catalog.РесурсныеСпецификации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСледующегоЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизводствоНаСтороне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УслугиПереработчика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяКалькуляции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_Extension/Reports/ВыпускЦехаСТрудозатратами/Ext/ObjectModule.bsl
&НаСервере
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
		КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
		
	// Получение параметров периода
	НайденныйПараметр = Неопределено;
    НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр = Неопределено тогда
		ВызватьИсключение "Не задан период!";
	КонецЕсли;
	Период = НайденныйПараметр.Значение;
	НайденныйПараметр = Неопределено;
	
	// Получение параметра подразделения
	Подразделение = Неопределено;
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Подразделение");
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
		Если НайденныйПараметр <> Неопределено И НайденныйПараметр.Использование Тогда
			Подразделение = НайденныйПараметр.Значение;
	КонецЕсли;
	КонецЕсли;
	
	Попытка 
		
		ТаблицаВыпуска = ТаблицаВыпускаЦехаСТрудозатратами(Период.ДатаНачала, Период.ДатаОкончания, Подразделение); 
		
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("ТаблицаВыпуска", ТаблицаВыпуска);
		
		//Настройки = КомпоновщикНастроек.Настройки;
		
		//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
		// Вывод описания параметров под отчётом
		ВывестиОписаниеПараметров(ДокументРезультат);

	Исключение
		Сообщить("Ошибка получения данных: " + ОписаниеОшибки());
	КонецПопытки;	

КонецПроцедуры

&НаСервере
Процедура ВывестиОписаниеПараметров(ДокументРезультат)
	
	ТекстОписания = "
	|
	|Описание параметров отчета
	|==========================
	|
	|Отчет показывает выпуск продукции цеха с расчетом трудозатрат за период.
	|
	|ИСТОЧНИК ДАННЫХ
	|---------------
	|Документ ЭтапПроизводства2_2 - табличные части:
	|  * ВыходныеИзделия - основной источник (изделия по рассчитываемой стоимости)
	|  * ПобочныеИзделия - используется, если ТЧ ВыходныеИзделия пуста
	|
	|Дата выпуска берется из поля ДатаПроизводства строки табличной части.
	|Отбираются только строки с признаком Произведено = Истина.
	|Трудозатраты рассчитываются рекурсивно по дереву спецификаций:
	|  * Для текущей спецификации - только трудозатраты указанного этапа
	|  * Рекурсия в полуфабрикаты со способом получения ""Произвести по спецификации""
	|  * Остановка рекурсии на полуфабрикатах со способом ""Обеспечивать""
	|
	|ФИЛЬТРЫ
	|-------
	|  * Только финальные этапы - выпускающие продукцию из заказа на производство
	|    (совпадение по Номенклатура + Характеристика с ТЧ Продукция заказа)
	|  * Исключаются спецификации из группы Ремонт (родитель с наименованием Ремонт)
	|  * У этапа должна быть заполнена спецификация
	|  * Этап должен быть проведен
	|
	|ПАРАМЕТРЫ
	|---------
	|ПЕРИОД (обязательный) - диапазон дат для анализа выпуска:
	|  * Фильтрует по дате производства из строки табличной части
	|
	|ПОДРАЗДЕЛЕНИЕ - фильтр по подразделению-исполнителю:
	|  * Указано - только выпуск данного подразделения (подразделение этапа)
	|  * Не указано - все подразделения
	|
	|КОЛОНКИ ОТЧЕТА
	|--------------
	|  * ЭтапПроизводства - документ этапа производства
	|  * ДатаВыпуска - дата производства из строки ТЧ
	|  * Номенклатура, Характеристика - выпущенная продукция
	|  * Количество - количество выпуска
	|  * Спецификация - ресурсная спецификация этапа
	|  * КоличествоТрудозатрат - рассчитанные трудозатраты по спецификации
	|  * СдельнаяРасценка - сдельная расценка из спецификации
	|
	|ПРИМЕЧАНИЕ
	|----------
	|Нулевые трудозатраты могут быть, если подразделение этапа производства
	|не совпадает с подразделением этапа в ТЧ Трудозатраты спецификации.
	|Например, этап выполняется цехом 14.2, а в спецификации трудозатраты
	|привязаны к цеху 14.3 - такие трудозатраты будут отфильтрованы.
	|";
	
	// Вывод текста описания построчно
	СтрокиОписания = СтрРазделить(ТекстОписания, Символы.ПС, Ложь);
	Для Каждого СтрокаОписания Из СтрокиОписания Цикл
		МакетСтроки = Новый ТабличныйДокумент;
		ОбластьСтроки = МакетСтроки.ПолучитьОбласть(1, 1, 1, 1);
		ОбластьСтроки.Область(1, 1).Текст = СтрокаОписания;
		ОбластьСтроки.Область(1, 1).ЦветТекста = WebЦвета.Серый;
		ДокументРезультат.Вывести(ОбластьСтроки);
	КонецЦикла;
	
КонецПроцедуры

// Формирует таблицу выпуска продукции цеха с трудозатратами
// Параметры:
//  ПериодНачало - Дата - начало периода отбора
//  ПериодКонец - Дата - конец периода отбора
//  Подразделение - СправочникСсылка.СтруктураПредприятия - подразделение-исполнитель
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с данными о выпуске и трудозатратах
Функция ТаблицаВыпускаЦехаСТрудозатратами(ПериодНачало = Неопределено, ПериодКонец = Неопределено, Подразделение = Неопределено)
	
	// Установка значений по умолчанию
	Если ПериодНачало = Неопределено Тогда
		ПериодНачало = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	Если ПериодКонец = Неопределено Тогда
		ПериодКонец = КонецДня(ТекущаяДатаСеанса());
	Иначе
		ПериодКонец = КонецДня(ПериодКонец);
	КонецЕсли;
	
	// Выборка данных напрямую из табличных частей этапов производства
	// Сначала выбираем из ВыходныеИзделия, затем для этапов без выходных изделий - из ПобочныеИзделия
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыходныеИзделияЭтапа.Ссылка КАК ЭтапПроизводства,
	|	ВыходныеИзделияЭтапа.ДатаПроизводства КАК ДатаВыпуска,
	|	ВыходныеИзделияЭтапа.Номенклатура КАК Номенклатура,
	|	ВыходныеИзделияЭтапа.Характеристика КАК Характеристика,
	|	СУММА(ВыходныеИзделияЭтапа.Количество) КАК Количество,
	|	ВыходныеИзделияЭтапа.Ссылка.Спецификация КАК Спецификация,
	|	ВыходныеИзделияЭтапа.Ссылка.Этап КАК ЭтапСпецификации
	|ПОМЕСТИТЬ ВТ_ВыходныеИзделия
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ВыходныеИзделияЭтапа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	|		ПО ВыходныеИзделияЭтапа.Ссылка.Спецификация = РесурсныеСпецификации.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ПродукцияЗаказа
	|		ПО ВыходныеИзделияЭтапа.Ссылка.Распоряжение = ПродукцияЗаказа.Ссылка
	|			И ВыходныеИзделияЭтапа.Номенклатура = ПродукцияЗаказа.Номенклатура
	|			И ВыходныеИзделияЭтапа.Характеристика = ПродукцияЗаказа.Характеристика
	|ГДЕ
	|	ВыходныеИзделияЭтапа.Ссылка.Проведен
	|	И ВыходныеИзделияЭтапа.Произведено
	|	И ВыходныеИзделияЭтапа.ДатаПроизводства МЕЖДУ &ПериодНачало И &ПериодКонец
	|	И ВыходныеИзделияЭтапа.Ссылка.Спецификация <> ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	|	И РесурсныеСпецификации.Родитель.Наименование <> &НаименованиеРодителяРемонт
	|	И (&Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		ИЛИ ВыходныеИзделияЭтапа.Ссылка.Подразделение = &Подразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыходныеИзделияЭтапа.Ссылка,
	|	ВыходныеИзделияЭтапа.ДатаПроизводства,
	|	ВыходныеИзделияЭтапа.Номенклатура,
	|	ВыходныеИзделияЭтапа.Характеристика,
	|	ВыходныеИзделияЭтапа.Ссылка.Спецификация,
	|	ВыходныеИзделияЭтапа.Ссылка.Этап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВыходныеИзделия.ЭтапПроизводства КАК ЭтапПроизводства
	|ПОМЕСТИТЬ ВТ_ЭтапыСВыходнымиИзделиями
	|ИЗ
	|	ВТ_ВыходныеИзделия КАК ВТ_ВыходныеИзделия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПобочныеИзделияЭтапа.Ссылка КАК ЭтапПроизводства,
	|	ПобочныеИзделияЭтапа.ДатаПроизводства КАК ДатаВыпуска,
	|	ПобочныеИзделияЭтапа.Номенклатура КАК Номенклатура,
	|	ПобочныеИзделияЭтапа.Характеристика КАК Характеристика,
	|	СУММА(ПобочныеИзделияЭтапа.Количество) КАК Количество,
	|	ПобочныеИзделияЭтапа.Ссылка.Спецификация КАК Спецификация,
	|	ПобочныеИзделияЭтапа.Ссылка.Этап КАК ЭтапСпецификации
	|ПОМЕСТИТЬ ВТ_ПобочныеИзделия
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ПобочныеИзделия КАК ПобочныеИзделияЭтапа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	|		ПО ПобочныеИзделияЭтапа.Ссылка.Спецификация = РесурсныеСпецификации.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ПродукцияЗаказа
	|		ПО ПобочныеИзделияЭтапа.Ссылка.Распоряжение = ПродукцияЗаказа.Ссылка
	|			И ПобочныеИзделияЭтапа.Номенклатура = ПродукцияЗаказа.Номенклатура
	|			И ПобочныеИзделияЭтапа.Характеристика = ПродукцияЗаказа.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЭтапыСВыходнымиИзделиями КАК ВТ_ЭтапыСВыходнымиИзделиями
	|		ПО ПобочныеИзделияЭтапа.Ссылка = ВТ_ЭтапыСВыходнымиИзделиями.ЭтапПроизводства
	|ГДЕ
	|	ПобочныеИзделияЭтапа.Ссылка.Проведен
	|	И ПобочныеИзделияЭтапа.Произведено
	|	И ПобочныеИзделияЭтапа.ДатаПроизводства МЕЖДУ &ПериодНачало И &ПериодКонец
	|	И ПобочныеИзделияЭтапа.Ссылка.Спецификация <> ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	|	И РесурсныеСпецификации.Родитель.Наименование <> &НаименованиеРодителяРемонт
	|	И (&Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		ИЛИ ПобочныеИзделияЭтапа.Ссылка.Подразделение = &Подразделение)
	|	И ВТ_ЭтапыСВыходнымиИзделиями.ЭтапПроизводства ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПобочныеИзделияЭтапа.Ссылка,
	|	ПобочныеИзделияЭтапа.ДатаПроизводства,
	|	ПобочныеИзделияЭтапа.Номенклатура,
	|	ПобочныеИзделияЭтапа.Характеристика,
	|	ПобочныеИзделияЭтапа.Ссылка.Спецификация,
	|	ПобочныеИзделияЭтапа.Ссылка.Этап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыходныеИзделия.ЭтапПроизводства КАК ЭтапПроизводства,
	|	ВТ_ВыходныеИзделия.ДатаВыпуска КАК ДатаВыпуска,
	|	ВТ_ВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ВТ_ВыходныеИзделия.Характеристика КАК Характеристика,
	|	ВТ_ВыходныеИзделия.Количество КАК Количество,
	|	ВТ_ВыходныеИзделия.Спецификация КАК Спецификация,
	|	ВТ_ВыходныеИзделия.ЭтапСпецификации КАК ЭтапСпецификации
	|ИЗ
	|	ВТ_ВыходныеИзделия КАК ВТ_ВыходныеИзделия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПобочныеИзделия.ЭтапПроизводства,
	|	ВТ_ПобочныеИзделия.ДатаВыпуска,
	|	ВТ_ПобочныеИзделия.Номенклатура,
	|	ВТ_ПобочныеИзделия.Характеристика,
	|	ВТ_ПобочныеИзделия.Количество,
	|	ВТ_ПобочныеИзделия.Спецификация,
	|	ВТ_ПобочныеИзделия.ЭтапСпецификации
	|ИЗ
	|	ВТ_ПобочныеИзделия КАК ВТ_ПобочныеИзделия";
	
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", ПериодКонец);
	Запрос.УстановитьПараметр("Подразделение", ?(Подразделение <> Неопределено, Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка()));
	Запрос.УстановитьПараметр("НаименованиеРодителяРемонт", "Ремонт");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Формирование результирующей таблицы
	ТаблицаВыпуска = Новый ТаблицаЗначений;
	ТаблицаВыпуска.Колонки.Добавить("ЭтапПроизводства");
	ТаблицаВыпуска.Колонки.Добавить("ДатаВыпуска");
	ТаблицаВыпуска.Колонки.Добавить("Номенклатура");
	ТаблицаВыпуска.Колонки.Добавить("Характеристика");
	ТаблицаВыпуска.Колонки.Добавить("Количество");
	ТаблицаВыпуска.Колонки.Добавить("Спецификация");
	ТаблицаВыпуска.Колонки.Добавить("КоличествоТрудозатрат");
	ТаблицаВыпуска.Колонки.Добавить("СдельнаяРасценка");
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЭтапПроизводства = Выборка.ЭтапПроизводства;
		ЭтапСпецификации = Выборка.ЭтапСпецификации;
		Спецификация = Выборка.Спецификация;
		
		Если ЗначениеЗаполнено(ЭтапПроизводства) И ЗначениеЗаполнено(Спецификация) Тогда
			
			// Расчет трудозатрат с рекурсией по полуфабрикатам (остановка на "Обеспечивать")
			СтруктураТрудозатрат = ТрудозатратыЭтапаСпецификацииРекурсивно(
				Спецификация, 
				ЭтапСпецификации,
				Выборка.Количество, 
				Подразделение,
				Выборка.ДатаВыпуска);
			
			НоваяСтрока = ТаблицаВыпуска.Добавить();
			НоваяСтрока.ЭтапПроизводства = ЭтапПроизводства;
			НоваяСтрока.ДатаВыпуска = Выборка.ДатаВыпуска;
			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
			НоваяСтрока.Характеристика = Выборка.Характеристика;
			НоваяСтрока.Количество = Выборка.Количество;
			НоваяСтрока.Спецификация = Спецификация;
			НоваяСтрока.КоличествоТрудозатрат = СтруктураТрудозатрат.КоличествоТрудозатрат;
			НоваяСтрока.СдельнаяРасценка = СтруктураТрудозатрат.СдельнаяРасценка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаВыпуска;
	
КонецФункции

// Рассчитывает трудозатраты рекурсивно по дереву спецификаций
// - Для текущей спецификации берёт трудозатраты только указанного этапа
// - Рекурсивно проваливается в полуфабрикаты со способом "Произвести по спецификации"
// - Останавливается на полуфабрикатах со способом "Обеспечивать"
// Параметры:
//  Спецификация - СправочникСсылка.РесурсныеСпецификации - спецификация
//  ЭтапСпецификации - СправочникСсылка.ЭтапыПроизводства - этап спецификации
//  Количество - Число - количество выпуска
//  Подразделение - СправочникСсылка.СтруктураПредприятия - подразделение для фильтрации
//  Дата - Дата - дата для получения расценок
// Возвращаемое значение:
//  Структура - структура с полями КоличествоТрудозатрат и СдельнаяРасценка
Функция ТрудозатратыЭтапаСпецификацииРекурсивно(Спецификация, ЭтапСпецификации, Количество, Подразделение = Неопределено, Дата = Неопределено)
	
	ПутьСпецификаций = Новый Массив;
	
	Возврат ТрудозатратыЭтапаСпецификацииРекурсия(
		Спецификация, 
		ЭтапСпецификации, 
		Количество, 
		Подразделение, 
		Дата,
		ПутьСпецификаций);
	
КонецФункции

// Внутренняя рекурсивная функция расчёта трудозатрат
Функция ТрудозатратыЭтапаСпецификацииРекурсия(Спецификация, ЭтапСпецификации, Количество, Подразделение, Дата, ПутьСпецификаций)
	
	Результат = Новый Структура;
	Результат.Вставить("КоличествоТрудозатрат", 0);
	Результат.Вставить("СдельнаяРасценка", 0);
	
	Если Не ЗначениеЗаполнено(Спецификация) Или Количество = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Защита от циклических ссылок
	Если ПутьСпецификаций.Найти(Спецификация) <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	ПутьСпецификаций.Добавить(Спецификация);
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// 1. Получение трудозатрат текущего этапа спецификации
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Трудозатраты.ВидРабот КАК ВидРабот,
	|	Трудозатраты.Количество КАК Количество,
	|	Трудозатраты.Ссылка.ОсновноеИзделиеКоличествоУпаковок КАК ОсновноеИзделиеКоличествоУпаковок,
	|	ЭтапыПроизводства.Подразделение КАК ПодразделениеТрудозатрат
	|ИЗ
	|	Справочник.РесурсныеСпецификации.Трудозатраты КАК Трудозатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	|		ПО Трудозатраты.Этап = ЭтапыПроизводства.Ссылка
	|ГДЕ
	|	Трудозатраты.Ссылка = &Спецификация
	|	И (Трудозатраты.Этап = &ЭтапСпецификации
	|		ИЛИ &ЭтапСпецификации = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка))
	|	И (&Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		ИЛИ ЭтапыПроизводства.Подразделение = &Подразделение)";
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("ЭтапСпецификации", ?(ЗначениеЗаполнено(ЭтапСпецификации), ЭтапСпецификации, Справочники.ЭтапыПроизводства.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Подразделение", ?(ЗначениеЗаполнено(Подразделение), Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка()));
	
	// Сбор трудозатрат текущего этапа
	СписокВидовРабот = Новый Массив;
	ТаблицаТрудозатрат = Новый ТаблицаЗначений;
	ТаблицаТрудозатрат.Колонки.Добавить("ВидРабот");
	ТаблицаТрудозатрат.Колонки.Добавить("КоличествоТрудозатрат");
	
	// Получение ОсновноеИзделиеКоличествоУпаковок для расчёта
	ОсновноеИзделиеКоличествоУпаковок = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОсновноеИзделиеКоличествоУпаковок = Выборка.ОсновноеИзделиеКоличествоУпаковок;
		
		Если ОсновноеИзделиеКоличествоУпаковок <> 0 Тогда
			КоличествоТрудозатрат = Выборка.Количество * Количество / ОсновноеИзделиеКоличествоУпаковок;
		Иначе
			КоличествоТрудозатрат = 0;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаТрудозатрат.Добавить();
		НоваяСтрока.ВидРабот = Выборка.ВидРабот;
		НоваяСтрока.КоличествоТрудозатрат = КоличествоТрудозатрат;
		
		Если СписокВидовРабот.Найти(Выборка.ВидРабот) = Неопределено Тогда
			СписокВидовРабот.Добавить(Выборка.ВидРабот);
		КонецЕсли;
		
	КонецЦикла;
	
	// Получение ОсновноеИзделиеКоличествоУпаковок если не было трудозатрат
	Если ОсновноеИзделиеКоличествоУпаковок = 0 Тогда
		ОсновноеИзделиеКоличествоУпаковок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация, "ОсновноеИзделиеКоличествоУпаковок");
		Если ОсновноеИзделиеКоличествоУпаковок = Неопределено Или ОсновноеИзделиеКоличествоУпаковок = 0 Тогда
			ОсновноеИзделиеКоличествоУпаковок = 1;
		КонецЕсли;
	КонецЕсли;
	
	// 2. Рекурсия в полуфабрикаты со способом "Произвести по спецификации"
	ЗапросМатериалы = Новый Запрос;
	ЗапросМатериалы.Текст =
	"ВЫБРАТЬ
	|	МатериалыИУслуги.Номенклатура КАК Материал,
	|	МатериалыИУслуги.КоличествоУпаковок КАК Количество,
	|	МатериалыИУслуги.Ссылка.ОсновноеИзделиеКоличествоУпаковок КАК ОсновноеИзделиеКоличествоУпаковок,
	|	ВЫРАЗИТЬ(МатериалыИУслуги.ИсточникПолученияПолуфабриката КАК Справочник.РесурсныеСпецификации).Ссылка КАК СпецификацияПолуфабриката
	|ИЗ
	|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК МатериалыИУслуги
	|ГДЕ
	|	МатериалыИУслуги.Ссылка = &Спецификация
	|	И МатериалыИУслуги.СпособПолученияМатериала = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации)
	|	И (МатериалыИУслуги.Этап = &ЭтапСпецификации
	|		ИЛИ &ЭтапСпецификации = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка))";
	
	ЗапросМатериалы.УстановитьПараметр("Спецификация", Спецификация);
	ЗапросМатериалы.УстановитьПараметр("ЭтапСпецификации", ?(ЗначениеЗаполнено(ЭтапСпецификации), ЭтапСпецификации, Справочники.ЭтапыПроизводства.ПустаяСсылка()));
	
	ВыборкаМатериалы = ЗапросМатериалы.Выполнить().Выбрать();
	
	Пока ВыборкаМатериалы.Следующий() Цикл
		
		// Определение спецификации полуфабриката
		СпецификацияПолуфабриката = Неопределено;
		Если ВыборкаМатериалы.СпецификацияПолуфабриката <> Null И ЗначениеЗаполнено(ВыборкаМатериалы.СпецификацияПолуфабриката) Тогда
			СпецификацияПолуфабриката = ВыборкаМатериалы.СпецификацияПолуфабриката;
		Иначе
			СпецификацияПолуфабриката = Расш1_ОбщийМодуль1.ПриоритетнаяСпецификация(ВыборкаМатериалы.Материал, Дата);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СпецификацияПолуфабриката) Тогда
			Продолжить;
		КонецЕсли;
		
		// Проверка подразделения последнего этапа спецификации полуфабриката
		ПодразделениеПоследнегоЭтапа = Расш1_ОбщийМодульКалькуляция.ПодразделениеПоследнегоЭтапаСпецификации(СпецификацияПолуфабриката);
		Если ЗначениеЗаполнено(Подразделение) И ПодразделениеПоследнегоЭтапа <> Подразделение Тогда
			Продолжить;
		КонецЕсли;
		
		// Расчёт количества полуфабриката
		Если ВыборкаМатериалы.ОсновноеИзделиеКоличествоУпаковок <> 0 Тогда
			КоличествоПолуфабриката = ВыборкаМатериалы.Количество / ВыборкаМатериалы.ОсновноеИзделиеКоличествоУпаковок * Количество;
		Иначе
			КоличествоПолуфабриката = 0;
		КонецЕсли;
		
		// Рекурсивный вызов для полуфабриката (без указания этапа - берём все этапы подразделения)
		РезультатПолуфабриката = ТрудозатратыЭтапаСпецификацииРекурсия(
			СпецификацияПолуфабриката,
			Справочники.ЭтапыПроизводства.ПустаяСсылка(),
			КоличествоПолуфабриката,
			Подразделение,
			Дата,
			ПутьСпецификаций);
		
		Результат.КоличествоТрудозатрат = Результат.КоличествоТрудозатрат + РезультатПолуфабриката.КоличествоТрудозатрат;
		Результат.СдельнаяРасценка = Результат.СдельнаяРасценка + РезультатПолуфабриката.СдельнаяРасценка;
		
	КонецЦикла;
	
	// 3. Расчёт трудозатрат текущего этапа
	Если ТаблицаТрудозатрат.Количество() > 0 Тогда
		
		// Получение расценок
		ТаблицаРасценок = Расш1_ОбщийМодульКалькуляция.ТаблицаРасценкиРабот(СписокВидовРабот, Дата);
		
		// Расчёт суммарных трудозатрат и расценок
		Для Каждого Строка Из ТаблицаТрудозатрат Цикл
			
			Результат.КоличествоТрудозатрат = Результат.КоличествоТрудозатрат + Строка.КоличествоТрудозатрат;
			
			НайденнаяРасценка = ТаблицаРасценок.Найти(Строка.ВидРабот, "ВидРаботТрудозатрат");
			Если НайденнаяРасценка <> Неопределено Тогда
				Результат.СдельнаяРасценка = Результат.СдельнаяРасценка + НайденнаяРасценка.Расценка * Строка.КоличествоТрудозатрат;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Убираем спецификацию из пути (для параллельных веток)
	Индекс = ПутьСпецификаций.Найти(Спецификация);
	Если Индекс <> Неопределено Тогда
		ПутьСпецификаций.Удалить(Индекс);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
